; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_19)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 - person
	)

  (:init
		(= (x b0) 6)
(= (y b0) 0)
(= (x b1) 7)
(= (y b1) 0)
(= (x b2) 9)
(= (y b2) 0)
(= (x b3) 7)
(= (y b3) 0)
(= (x b4) -5)
(= (y b4) 0)
(= (x b5) 1)
(= (y b5) 0)
(= (x b6) 5)
(= (y b6) 0)
(= (x b7) -5)
(= (y b7) 0)
(= (x b8) 10)
(= (y b8) 0)
(= (x b9) -3)
(= (y b9) 0)
(= (x b10) 4)
(= (y b10) 0)
(= (x b11) 5)
(= (y b11) 0)
(= (x b12) 5)
(= (y b12) 0)

		(= (d p0) 90)
(= (d p1) 24)
(= (d p2) 63)
(= (d p3) 18)
(= (d p4) 77)
(= (d p5) 21)
(= (d p6) 33)
(= (d p7) 83)
(= (d p8) 67)
(= (d p9) 58)
(= (d p10) 80)
(= (d p11) 50)
(= (d p12) 27)
(= (d p13) 44)
(= (d p14) 38)
(= (d p15) 83)
(= (d p16) 13)
(= (d p17) 27)
(= (d p18) 89)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
(saved p14)
(saved p15)
(saved p16)
(saved p17)
(saved p18)
		)
	)
)

; plan
1. (go_north_east b5)
   changed: (x b5) from 1 to 2.5, (y b5) from 0 to 1.5
   goals met: 0 of 19
2. (go_north_east b5)
   changed: (x b5) from 2.5 to 4, (y b5) from 1.5 to 3
   goals met: 0 of 19
3. (go_north_east b5)
   changed: (x b5) from 4 to 5.5, (y b5) from 3 to 4.5
   goals met: 0 of 19
4. (go_north_east b5)
   changed: (x b5) from 5.5 to 7, (y b5) from 4.5 to 6
   goals met: 0 of 19
5. (go_north_east b5)
   changed: (x b5) from 7 to 8.5, (y b5) from 6 to 7.5
   goals met: 0 of 19
6. (go_north_east b5)
   changed: (x b5) from 8.5 to 10, (y b5) from 7.5 to 9
   goals met: 0 of 19
7. (go_north_west b5)
   changed: (x b5) from 10 to 8.5, (y b5) from 9 to 10.5
   goals met: 0 of 19
8. (go_north_west b5)
   changed: (x b5) from 8.5 to 7, (y b5) from 10.5 to 12
   goals met: 0 of 19
9. (go_north_west b5)
   changed: (x b5) from 7 to 5.5, (y b5) from 12 to 13.5
   goals met: 0 of 19
10. (go_north_west b5)
   changed: (x b5) from 5.5 to 4, (y b5) from 13.5 to 15
   goals met: 0 of 19
11. (go_north_west b5)
   changed: (x b5) from 4 to 2.5, (y b5) from 15 to 16.5
   goals met: 0 of 19
12. (save_person b5 p16)
   added: (saved p16)
   goals met: 1 of 19
13. (go_north_west b5)
   changed: (x b5) from 2.5 to 1, (y b5) from 16.5 to 18
   goals met: 1 of 19
14. (go_north_west b5)
   changed: (x b5) from 1 to -0.5, (y b5) from 18 to 19.5
   goals met: 1 of 19
15. (save_person b5 p3)
   added: (saved p3)
   goals met: 2 of 19
16. (go_north_west b5)
   changed: (x b5) from -0.5 to -2, (y b5) from 19.5 to 21
   goals met: 2 of 19
17. (go_north_west b5)
   changed: (x b5) from -2 to -3.5, (y b5) from 21 to 22.5
   goals met: 2 of 19
18. (go_north_west b5)
   changed: (x b5) from -3.5 to -5, (y b5) from 22.5 to 24
   goals met: 2 of 19
19. (go_north_west b5)
   changed: (x b5) from -5 to -6.5, (y b5) from 24 to 25.5
   goals met: 2 of 19
20. (go_north_west b5)
   changed: (x b5) from -6.5 to -8, (y b5) from 25.5 to 27
   goals met: 2 of 19
21. (go_north_west b5)
   changed: (x b5) from -8 to -9.5, (y b5) from 27 to 28.5
   goals met: 2 of 19
22. (go_north_west b5)
   changed: (x b5) from -9.5 to -11, (y b5) from 28.5 to 30
   goals met: 2 of 19
23. (go_north_west b5)
   changed: (x b5) from -11 to -12.5, (y b5) from 30 to 31.5
   goals met: 2 of 19
24. (go_north_east b5)
   changed: (x b5) from -12.5 to -11, (y b5) from 31.5 to 33
   goals met: 2 of 19
25. (save_person b5 p5)
   added: (saved p5)
   goals met: 3 of 19
26. (go_north_west b5)
   changed: (x b5) from -11 to -12.5, (y b5) from 33 to 34.5
   goals met: 3 of 19
27. (go_north_east b5)
   changed: (x b5) from -12.5 to -11, (y b5) from 34.5 to 36
   goals met: 3 of 19
28. (save_person b5 p1)
   added: (saved p1)
   goals met: 4 of 19
29. (go_north_west b5)
   changed: (x b5) from -11 to -12.5, (y b5) from 36 to 37.5
   goals met: 4 of 19
30. (go_north_east b5)
   changed: (x b5) from -12.5 to -11, (y b5) from 37.5 to 39
   goals met: 4 of 19
31. (go_north_east b5)
   changed: (x b5) from -11 to -9.5, (y b5) from 39 to 40.5
   goals met: 4 of 19
32. (go_north_east b5)
   changed: (x b5) from -9.5 to -8, (y b5) from 40.5 to 42
   goals met: 4 of 19
33. (go_north_east b5)
   changed: (x b5) from -8 to -6.5, (y b5) from 42 to 43.5
   goals met: 4 of 19
34. (go_north_east b5)
   changed: (x b5) from -6.5 to -5, (y b5) from 43.5 to 45
   goals met: 4 of 19
35. (go_north_east b5)
   changed: (x b5) from -5 to -3.5, (y b5) from 45 to 46.5
   goals met: 4 of 19
36. (go_north_east b5)
   changed: (x b5) from -3.5 to -2, (y b5) from 46.5 to 48
   goals met: 4 of 19
37. (go_north_east b5)
   changed: (x b5) from -2 to -0.5, (y b5) from 48 to 49.5
   goals met: 4 of 19
38. (go_north_east b5)
   changed: (x b5) from -0.5 to 1, (y b5) from 49.5 to 51
   goals met: 4 of 19
39. (save_person b5 p6)
   added: (saved p6)
   goals met: 5 of 19
40. (save_person b5 p11)
   added: (saved p11)
   goals met: 6 of 19
41. (save_person b5 p12)
   added: (saved p12)
   goals met: 7 of 19
42. (save_person b5 p13)
   added: (saved p13)
   goals met: 8 of 19
43. (save_person b5 p14)
   added: (saved p14)
   goals met: 9 of 19
44. (save_person b5 p17)
   added: (saved p17)
   goals met: 10 of 19
45. (go_north_east b5)
   changed: (x b5) from 1 to 2.5, (y b5) from 51 to 52.5
   goals met: 10 of 19
46. (go_north_east b5)
   changed: (x b5) from 2.5 to 4, (y b5) from 52.5 to 54
   goals met: 10 of 19
47. (go_north_east b5)
   changed: (x b5) from 4 to 5.5, (y b5) from 54 to 55.5
   goals met: 10 of 19
48. (go_north_east b5)
   changed: (x b5) from 5.5 to 7, (y b5) from 55.5 to 57
   goals met: 10 of 19
49. (go_north_west b5)
   changed: (x b5) from 7 to 5.5, (y b5) from 57 to 58.5
   goals met: 10 of 19
50. (go_north_west b5)
   changed: (x b5) from 5.5 to 4, (y b5) from 58.5 to 60
   goals met: 10 of 19
51. (go_north_west b5)
   changed: (x b5) from 4 to 2.5, (y b5) from 60 to 61.5
   goals met: 10 of 19
52. (save_person b5 p9)
   added: (saved p9)
   goals met: 11 of 19
53. (go_north_west b5)
   changed: (x b5) from 2.5 to 1, (y b5) from 61.5 to 63
   goals met: 11 of 19
54. (go_north_west b5)
   changed: (x b5) from 1 to -0.5, (y b5) from 63 to 64.5
   goals met: 11 of 19
55. (save_person b5 p2)
   added: (saved p2)
   goals met: 12 of 19
56. (go_north_west b5)
   changed: (x b5) from -0.5 to -2, (y b5) from 64.5 to 66
   goals met: 12 of 19
57. (go_north_west b5)
   changed: (x b5) from -2 to -3.5, (y b5) from 66 to 67.5
   goals met: 12 of 19
58. (go_north_west b5)
   changed: (x b5) from -3.5 to -5, (y b5) from 67.5 to 69
   goals met: 12 of 19
59. (go_north_west b5)
   changed: (x b5) from -5 to -6.5, (y b5) from 69 to 70.5
   goals met: 12 of 19
60. (go_north_west b5)
   changed: (x b5) from -6.5 to -8, (y b5) from 70.5 to 72
   goals met: 12 of 19
61. (go_north_west b5)
   changed: (x b5) from -8 to -9.5, (y b5) from 72 to 73.5
   goals met: 12 of 19
62. (go_north_west b5)
   changed: (x b5) from -9.5 to -11, (y b5) from 73.5 to 75
   goals met: 12 of 19
63. (go_north_west b5)
   changed: (x b5) from -11 to -12.5, (y b5) from 75 to 76.5
   goals met: 12 of 19
64. (go_north_west b5)
   changed: (x b5) from -12.5 to -14, (y b5) from 76.5 to 78
   goals met: 12 of 19
65. (go_north_east b5)
   changed: (x b5) from -14 to -12.5, (y b5) from 78 to 79.5
   goals met: 12 of 19
66. (go_north_east b5)
   changed: (x b5) from -12.5 to -11, (y b5) from 79.5 to 81
   goals met: 12 of 19
67. (go_north_east b5)
   changed: (x b5) from -11 to -9.5, (y b5) from 81 to 82.5
   goals met: 12 of 19
68. (go_north_east b5)
   changed: (x b5) from -9.5 to -8, (y b5) from 82.5 to 84
   goals met: 12 of 19
69. (go_north_east b5)
   changed: (x b5) from -8 to -6.5, (y b5) from 84 to 85.5
   goals met: 12 of 19
70. (save_person b5 p4)
   added: (saved p4)
   goals met: 13 of 19
71. (save_person b5 p8)
   added: (saved p8)
   goals met: 14 of 19
72. (go_north_east b5)
   changed: (x b5) from -6.5 to -5, (y b5) from 85.5 to 87
   goals met: 14 of 19
73. (save_person b5 p10)
   added: (saved p10)
   goals met: 15 of 19
74. (go_north_east b5)
   changed: (x b5) from -5 to -3.5, (y b5) from 87 to 88.5
   goals met: 15 of 19
75. (go_north_east b5)
   changed: (x b5) from -3.5 to -2, (y b5) from 88.5 to 90
   goals met: 15 of 19
76. (go_north_east b5)
   changed: (x b5) from -2 to -0.5, (y b5) from 90 to 91.5
   goals met: 15 of 19
77. (save_person b5 p0)
   added: (saved p0)
   goals met: 16 of 19
78. (save_person b5 p7)
   added: (saved p7)
   goals met: 17 of 19
79. (save_person b5 p15)
   added: (saved p15)
   goals met: 18 of 19
80. (save_person b5 p18)
   added: (saved p18)
   goals met: 19 of 19
